# 월드컵 출전선수 골기록 데이터

In [34]:
import pandas as pd

df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/worldcup/worldcupgoals.csv')
df.head()

           Player  Goals                Years  Country
0  Miroslav Klose     16  2002-2006-2010-2014  Germany
1         Ronaldo     15       1998-2002-2006   Brazil
2     Gerd Muller     14            1970-1974  Germany
3   Just Fontaine     13                 1958   France
4            Pele     12  1958-1962-1966-1970   Brazil

### Q21. 주어진 전체 기간의 각 나라별 골득점수 상위 5개 국가와 그 득점수를 데이터프레임형태로 출력하라

In [7]:
df.info(), df.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1295 entries, 0 to 1294
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Player   1295 non-null   object
 1   Goals    1295 non-null   int64
 2   Years    1295 non-null   object
 3   Country  1295 non-null   object
dtypes: int64(1), object(3)
memory usage: 40.6+ KB

(None, (1295, 4))

In [16]:
## 답
result = df[['Country', 'Goals']].groupby('Country').sum().sort_values('Goals',ascending=False).head(5)
display(result)

           Goals
Country
Brazil       228
Germany      226
Argentina    135
Italy        123
France       115

### Q22. 주어진 전체기간동안 골득점을 한 선수가 가장 많은 나라 상위 5개 국가와 그 선수 숫자를 데이터 프레임 형식으로 출력하라

In [19]:
display(df[['Country', 'Player']].groupby('Country').count().sort_values('Player', ascending=False).head())

           Player
Country
Brazil         81
Germany        78
Italy          60
Argentina      59
France         58

In [20]:
## 답
result = df.groupby('Country').size().sort_values(ascending=False).head(5)
print(result)

Country
Brazil       81
Germany      78
Italy        60
Argentina    59
France       58
dtype: int64

### Q23. Years 컬럼은 년도 -년도 형식으로 구성되어있고, 각 년도는 4자리 숫자이다. 년도 표기가 4자리 숫자로 안된 케이스가 존재한다. 해당 건은 몇건인지 출력하라

In [31]:
years = df.Years
years = list(years)

cnt = 0
for y in years:
    tmp = y.split('-')
    for t in tmp:
        if len(t) != 4:
            cnt += 1
            
print(cnt)

45

In [32]:
## 답
df['yearLst'] = df.Years.str.split('-')

def checkFour(x):
    for value in x:
        if len(str(value)) != 4:
            return False
        
    return True
    
df['check'] = df['yearLst'].apply(checkFour)

result = len(df[df.check ==False])
result

45

### Q25. 월드컵 출전횟수를 나타내는 ‘LenCup’ 컬럼을 추가하고 4회 출전한 선수의 숫자를 구하여라

In [40]:
df['LenCup'] = df.Years.str.split('-')
df['LenCup'] = [len(x) for x in df['LenCup']]

In [48]:
print(len(df[df.LenCup==4]))

16

In [ ]:
## 답
df2['LenCup'] =df2['yearLst'].str.len()
result = df2['LenCup'].value_counts()[4]
print(result)

### Q26. Yugoslavia 국가의 월드컵 출전횟수가 2회인 선수들의 숫자를 구하여라

In [52]:
print(len(df[(df.Country=='Yugoslavia') & (df.LenCup==2)]))

7

In [ ]:
## 답
result = len(df2[(df2.LenCup==2) & (df2.Country =='Yugoslavia')])
print(result)

### Q27. 2002년도에 출전한 전체 선수는 몇명인가?

In [58]:
cnt = 0
for year in df['Years']:
    if '2002' in year: cnt+=1

print(cnt)

156

In [59]:
## 답
result =len(df2[df2.Years.str.contains('2002')])
print(result)

NameError: name 'df2' is not defined

### Q28. 이름에 ‘carlos’ 단어가 들어가는 선수의 숫자는 몇 명인가? (대, 소문자 구분 x)

In [62]:
cnt = 0
for name in df['Player']:
    if 'carlos' in name.lower(): cnt+=1

print(cnt)

13

In [ ]:
## answer
result = len(df2[df2.Player.str.lower().str.contains('carlos')])
print(result)

### Q29. 월드컵 출전 횟수가 1회뿐인 선수들 중에서 가장 많은 득점을 올렸던 선수는 누구인가?

In [69]:
print(df[df.LenCup==1].sort_values('Goals', ascending=False).Player.values[0])

Just Fontaine

### Q30. 월드컵 출전횟수가 1회 뿐인 선수들이 가장 많은 국가는 어디인가?

In [83]:
print(df[df.LenCup==1].groupby('Country').size().sort_values(ascending=False).index[0])

Brazil

In [ ]:
## answer
result= df2[df2.LenCup==1].Country.value_counts().index[0]
print(result)

# 서울시 따릉이 이용정보 데이터

In [1]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv')
df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

### Q31. 대여일자별 데이터의 수를 데이터프레임으로 출력하고, 가장 많은 데이터가 있는 날짜를 출력하라

In [2]:
import numpy as np

In [3]:
result = df['대여일자'].value_counts().sort_index().to_frame()
max_ = result.sort_values('count', ascending=False).index[0]
display(result)
print(max_)

            count
대여일자
2021-06-01  48081
2021-06-02  56100
2021-06-03  18985
2021-06-04  56788
2021-06-05  52730
2021-06-06  47787
2021-06-07  52623
2021-06-08  55623
2021-06-09  54507
2021-06-10  36992
2021-06-11  52089
2021-06-12  48569
2021-06-13  43131
2021-06-14  54945

2021-06-04

### Q32. 각 일자의 요일을 표기하고 (‘Monday’ ~’Sunday’) ‘day_name’컬럼을 추가하고 이를 이용하여 각 요일별 이용 횟수의 총합을 데이터 프레임으로 출력하라

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678950 entries, 0 to 678949
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    678950 non-null  object
 1   대여시간    678950 non-null  int64
 2   대여소번호   678950 non-null  int64
 3   대여구분코드  678950 non-null  object
 4   성별      678950 non-null  object
 5   연령대코드   678950 non-null  object
 6   이용건수    678950 non-null  int64
 7   운동량     678950 non-null  object
 8   탄소량     678950 non-null  object
 9   이동거리    678950 non-null  float64
 10  사용시간    678950 non-null  int64
dtypes: float64(1), int64(4), object(6)
memory usage: 57.0+ MB

In [5]:
df['day_name'] = pd.to_datetime(df['대여일자']).dt.day_name()
df.day_name

0         Tuesday
1         Tuesday
2         Tuesday
3         Tuesday
4         Tuesday
           ...
678945     Monday
678946     Monday
678947     Monday
678948     Monday
678949     Monday
Name: day_name, Length: 678950, dtype: object

In [14]:
display(df.day_name.value_counts().to_frame())

            count
day_name
Wednesday  110607
Friday     108877
Monday     107568
Tuesday    103704
Saturday   101299
Sunday      90918
Thursday    55977

In [ ]:
## answer
df['대여일자'] = pd.to_datetime(df['대여일자'])
df['day_name']  = df['대여일자'].dt.day_name()

result =  df.day_name.value_counts().to_frame()
print(result)

### Q33. 각 요일별 가장 많이 이용한 대여소의 이용횟수와 대여소 번호를 데이터 프레임으로 출력하라

In [27]:
result = df.groupby(['day_name', '대여소번호']).size().to_frame('size')
result

                 size
day_name  대여소번호
Friday    102     145
          103     143
          104      72
          105      60
          106     155
...               ...
Wednesday 4867     20
          4868      5
          9980      1
          9997      4
          9999      6

[16874 rows x 1 columns]

In [34]:
display(result.sort_values('size', ascending=False).reset_index().drop_duplicates('day_name').reset_index(drop=True))

    day_name  대여소번호  size
0   Saturday    502   378
1     Sunday    502   372
2  Wednesday    502   282
3     Friday    502   277
4    Tuesday    502   267
5     Monday    502   242
6   Thursday   2715   137

### Q34. 나이대별 대여구분 코드의 (일일권/전체횟수) 비율을 구한 후 가장 높은 비율을 가지는 나이대를 확인하라. 일일권의 경우 일일권 과 일일권(비회원)을 모두 포함하라

In [15]:
 df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678950 entries, 0 to 678949
Data columns (total 12 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   대여일자      678950 non-null  object
 1   대여시간      678950 non-null  int64
 2   대여소번호     678950 non-null  int64
 3   대여구분코드    678950 non-null  object
 4   성별        678950 non-null  object
 5   연령대코드     678950 non-null  object
 6   이용건수      678950 non-null  int64
 7   운동량       678950 non-null  object
 8   탄소량       678950 non-null  object
 9   이동거리      678950 non-null  float64
 10  사용시간      678950 non-null  int64
 11  day_name  678950 non-null  object
dtypes: float64(1), int64(4), object(7)
memory usage: 62.2+ MB

In [52]:
daily = df[df.대여구분코드.isin(['일일권', '일일권(비회원)'])].연령대코드.value_counts().sort_index()
total = df.연령대코드.value_counts().sort_index()

In [47]:
## answer
daily = df[df.대여구분코드.isin(['일일권','일일권(비회원)'])].연령대코드.value_counts().sort_index()
total = df.연령대코드.value_counts().sort_index()

ratio = (daily /total).sort_values(ascending=False)
print(ratio)
print('max ratio age ',ratio.index[0])

연령대코드
~10대    0.312525
20대     0.239913
30대     0.166702
40대     0.110585
50대     0.065414
70대~    0.048962
60대     0.042462
Name: count, dtype: float64
max ratio age  ~10대

### Q35. 연령대별 평균 이동거리를 구하여라

In [55]:
print(df[['연령대코드', '이동거리']].groupby('연령대코드').mean())

              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

### Q36. 연령대 코드가 20대인 데이터를 추출하고,이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출한다.최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬 후 1행부터 200행까지의 탄소량의 평균을 소숫점 3째 자리까지 구하여라

In [73]:
result = df[df.연령대코드=='20대'].reset_index(drop=True)
result = result[result.이동거리 >= result.이동거리.mean()].reset_index(drop=True)
result.탄소량 = result.탄소량.astype('float')
result = result.sort_values(['대여일자', '대여소번호'], ascending=False).reset_index(drop=True)
result = result[:200]

print(round(result.탄소량.mean(), 3))

1.613

In [70]:
## answer
tw = df[df.연령대코드 =='20대'].reset_index(drop=True)
tw_mean = tw[tw.이동거리 >= tw.이동거리.mean()].reset_index(drop=True)
tw_mean['탄소량'] =tw_mean['탄소량'].astype('float')
target =tw_mean.sort_values(['대여일자','대여소번호'], ascending=False).reset_index(drop=True).iloc[:200].탄소량
result = round(target.sum()/len(target),3)
print(result)

1.613

### Q37. 6월 7일 ~10대의 “이용건수”의 중앙값은?

In [78]:
print(df[(df.대여일자 == '2021-06-07') & (df.연령대코드=='~10대')].이용건수.median())

1.0

### Q38. 평일 (월~금) 출근 시간대(오전 6,7,8시)의 대여소별 이용 횟수를 구해서 데이터 프레임 형태로 표현한 후 각 대여시간별 이용 횟수의 상위 3개 대여소와 이용횟수를 출력하라

In [99]:
result = df[(df.대여시간.isin([6,7,8])) & (df.day_name.isin(['Tuesday','Wednesday','Thursday','Friday','Monday']))]
display(result.groupby(['대여시간', '대여소번호']).size().to_frame('이용 횟수').sort_values(['대여시간', '이용 횟수'], ascending=False).groupby('대여시간').head(3))

            이용 횟수
대여시간 대여소번호
8    2701     119
     646      115
     1152      92
7    259      104
     230       77
     726       77
6    2744      45
     1125      40
     1028      36

### Q39. 이동거리의 평균 이상의 이동거리 값을 가지는 데이터를 추출하여 추출데이터의 이동거리의 표본표준편차 값을 구하여라

In [104]:
result = df[df.이동거리 >= df.이동거리.mean()]
print(np.sqrt(result.이동거리.var()))

5092.139707505356

### Q40. 남성(‘M’ or ‘m’)과 여성(‘F’ or ‘f’)의 이동거리값의 평균값을 구하여라

In [109]:
df.성별 = df.성별.str.upper()
display(df.groupby('성별').이동거리.mean().to_frame('이동거리평균'))

         이동거리평균
성별
F   3468.575025
M   3209.110871

# 전세계 행복도 지표 데이터

In [110]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/happy2/happiness.csv',encoding='utf-8')
df.head()

,행복랭킹,나라명,점수,상대GDP,사회적지원,행복기대치,선택의 자유도,관대함,부패에 대한인식,년도
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393,2019
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410,2019
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341,2019
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118,2019
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298,2019